[
  {
    "id": "proj-001",
    "title": "Quantum Leap Social Network",
    "description": "A social network exclusively for time travelers. The user base was difficult to acquire due to temporal paradoxes and the fact that most users hadn't been born yet.",
    "tags": [
      "social",
      "quantum-physics",
      "failed-marketing",
      "dummy"
    ],
    "attempts_count": 1,
    "reasons_for_failure": [
      "Market too niche",
      "Technical constraints"
    ],
    "attempts": [
      {
        "year": 2023,
        "description": "Initial launch. The platform worked, but the chicken-and-egg problem was magnified by non-linear timelines. Gained a user in 2042 who complained about the 'retro' UI.",
        "links": {
          "repo": "https://github.com/example/q-social",
          "postmortem": "https://example.blog/q-social-postmortem"
        }
      }
    ]
  },
  {
    "id": "proj-002",
    "title": "AI-Powered Pet Translator",
    "description": "A collar that translates your pet's barks and meows into plain English. Unfortunately, it turns out most pets just want to talk about food, naps, and squirrels.",
    "tags": [
      "iot",
      "ai",
      "hardware",
      "disappointing-results",
      "dummy"
    ],
    "attempts_count": 3,
    "reasons_for_failure": [
      "Lack of market interest",
      "Product-market fit"
    ],
    "attempts": [
      {
        "year": 2021,
        "description": "Prototype v1. Used a Raspberry Pi. The translation algorithm was 90% accurate but the insights were 100% boring.",
        "links": {}
      },
      {
        "year": 2022,
        "description": "Sleeker collar design. Added a 'deep thoughts' filter, which was just a random philosophy quote generator. Users were not fooled.",
        "links": {}
      },
      {
        "year": 2023,
        "description": "Pivoted to translating squirrels. This was a technical success but a commercial and existential nightmare.",
        "links": {}
      }
    ]
  },
  {
    "id": "proj-003",
    "title": "Blockchain To-Do List",
    "description": "A decentralized to-do list app where every task is a non-fungible token (NFT). Users found the gas fees for adding 'buy milk' to the blockchain were prohibitively expensive.",
    "tags": [
      "blockchain",
      "nft",
      "over-engineered",
      "dummy"
    ],
    "attempts_count": 1,
    "reasons_for_failure": [
      "Over-engineered",
      "High operational cost"
    ],
    "attempts": [
      {
        "year": 2022,
        "description": "Launched on the Ethereum mainnet. The concept of 'immutably pending' tasks was confusing, and the cost to check off a task sometimes exceeded the cost of the item on the list.",
        "links": {
          "repo": "https://github.com/example/nft-todo"
        }
      }
    ]
  },
  {
    "id": "proj-004",
    "submitted_by": "architrixs",
    "title": "DevCrush",
    "description": "A dating site exclusively for software developers, aiming to connect people through shared technical interests and late-night coding sessions.",
    "tags": [
      "social",
      "dating",
      "web-app",
      "abandoned"
    ],
    "attempts_count": 1,
    "reasons_for_failure": [
      "Founder burnout",
      "Lack of market interest"
    ],
    "attempts": [
      {
        "year": 2023,
        "description": "Initial concept and prototype. The idea was deemed a bit silly and ultimately abandoned due to the founder not having enough time to dedicate to the project.",
        "links": {}
      }
    ]
  },
  {
    "id": "proj-005",
    "title": "JobPilot – Automated Job Submission Engine",
    "submitted_by": "Manik400",
    "description": "A system that saves job application links manually through an 'Add' button and later auto-fills and auto-submits all applications using a master profile. Designed to eliminate repetitive login and form-filling across different job platforms by running scheduled apply sessions. The platform attempts to fully automate job submission while navigating legal and ToS-related constraints.",
    "tags": [
      "automation",
      "ai",
      "job-search",
      "productivity",
      "chrome-extension",
      "legal-challenge"
    ],
    "attempts_count": 0,
    "reasons_for_failure": [
      "Full auto-submit introduces ToS and legal complications",
      "Complexity in handling different ATS, forms, and security flows",
      "Security risks in handling credentials",
      "Auto Login automation blocked by OTP/CAPTCHA"
    ],
    "attempts": []
  }
]